#include "add_module.h"

int main()
{
    FILE *f;
    char f_name[20];
    int n = 0, count = 0, del_timesheet, choice, timesheet, experience;
    string del_surname, check_gender, check_year, surname, name, patronymic, bday, bmonth, byear, year, subject, num, address;
    Gender gender;
    bool degree;
    teacher *T;
    T = (teacher *)malloc(n * sizeof(teacher));
    do
    {
        cout << ("\n");
        cout << ("Меню программы:\n");
        cout << "1.Добавление информации о новом учителе\n";
        cout << "2.Удаление информации об учителе\n";
        cout << "3.Отображение информации об учетелях в виде таблицы\n";
        cout << "4.Поиск инофрмации об учителях по году рождения\n";
        cout << "5.Определение кол-ва учителей мужского пола с ученой степенью\n";
        cout << "6.Сохранение данных в файл\n";
        cout << "7.Чтение из файла\n";
        cout << "8.Выход из программы\n";
        cout << "Выбранный пункт меню - ";
        cin >> choice;
        switch(choice)
        {
            break;
        case 1:
        {
            T->AddTeacher(&n, &T);
            n += 1;
            break;
        }
        case 2:
            cout << "1)Удаление по табельному номеру\n2)Удаление по фамилии\n3)Удаление по табельному номеру и фамилии\n";
            cout << "Выбранный пункт - ";
            cin >> choice;
            if (choice == 1)
            {

                cout << "Введите табельный номер - ";
                cin >> del_timesheet;
                T->Del(del_timesheet, &n, T);
                break;
            }
            else if (choice == 2)
            {

                cout << "Введите фамилию учителя - ";
                cin >> del_surname;
                T->Del(del_surname, &n, T);
                break;
            }
            else if (choice == 3)
            {

                cout << "Введите табельный номер и фамилию учителя - ";
                cin >> del_timesheet >> del_surname;
                T->Del(del_timesheet, del_surname, &n, T);
                break;
            }
            else
            {
                cout << "\nОшибка\n";
                break;
            }

        case 3:
            printf("----------------------------------------------------------------------------------------------------------------------------------------------------\n");
            printf("|Табельный номер|  Фамилия  |    Имя    |  Отчество   | Дата рождения | Пол |    Предмет    | Стаж |    Номер    |       Адрес       | Уч. степень |\n");
            printf("----------------------------------------------------------------------------------------------------------------------------------------------------\n");
            for (int i = 0; i < n; i++)
            {
                T->ShowTeach(i, T);
            }
            printf("----------------------------------------------------------------------------------------------------------------------------------------------------\n");
            break;
        case 4:
            cout << "Введите год рождения - ";
            cin >> check_year;
            printf("----------------------------------------------------------------------------------------------------------------------------------------------------\n");
            printf("|Табельный номер|  Фамилия  |    Имя    |  Отчество   | Дата рождения | Пол |    Предмет    | Стаж |    Номер    |       Адрес       | Уч. степень |\n");
            printf("----------------------------------------------------------------------------------------------------------------------------------------------------\n");
            for (int i = 0; i < n; i++)
            {
                if (T[i].born.year == check_year)
                {

                    T->ShowTeach(i, T);
                }
            }
            printf("----------------------------------------------------------------------------------------------------------------------------------------------------\n");
            break;
        case 5:
            check_gender = "M";
            for (int i = 0; i < n; i++)
            {
                if ((T[i].gender == male) && (T[i].degree == 1))
                {
                    count++;
                }
            }
            cout << "Количество учителей мужского пола с ученой степенью = " << count;
            count = 0;
            break;
        case 6:
            Save(T, &n);
            break;
        case 7:
            Load(T, &n);
            break;
        case 8:
            exit(0);
            break;
        default:
            cout << "Ошибка\n";
        }
    } while (1 == 1);
}
